# Задача 31: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#          0  1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  18  19
# 5
# 15
# Вывод: [1, 9, 13, 14, 19

 
min, max = 5, 15
data = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
indexes = [i for i, x in enumerate(data) if min <= x <= max]
print("Индексы:",indexes)



